#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1FE (0x2B8 - 0xBA)
// BlueprintGeneratedClass BP_CreatureComponent_Audio.BP_CreatureComponent_Audio_C
class UBP_CreatureComponent_Audio_C : public UBP_CreatureComponentBase_C
{
public:
	uint8                                        Pad_672D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xC0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	enum class EFootstepSoundType                FootstepSoundType;                                 // 0xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseAlertReactionOnSpawn;                           // 0xC9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_672E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       AlertCooldownTime;                                 // 0xD0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AlertSpawnCooldownTime;                            // 0xD8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TakeDamageCooldownTime;                            // 0xE0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          AlertSFX;                                          // 0xE8(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          DeathSFX;                                          // 0x110(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         AlertReady;                                        // 0x138(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TakeDamageReady;                                   // 0x139(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_672F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          FootstepTypeTag;                                   // 0x13C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6730[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       AttenuationScaling_Spyglass;                       // 0x148(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InSpyglassMode;                                    // 0x150(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6731[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkComponent*                          Ak_Ambient;                                        // 0x158(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                 CachedAudioEvents;                                 // 0x160(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ANWXAICharacter*                       CreatureOwner;                                     // 0x170(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAkAudioEvent*>                 CachedFootstepsAudio;                              // 0x178(0x10)(Edit, BlueprintVisible)
	TArray<class UAkSwitchValue*>                WaterDepthSwitches;                                // 0x188(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAkAudioEvent>          TakeDamageSFX;                                     // 0x198(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          StaggerDamageSFX;                                  // 0x1C0(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          KnockdownDamageSFX;                                // 0x1E8(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UAkAudioEvent>          ExplosiveDamageSFX;                                // 0x210(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UAudioComponentAggregatorComponent*    CachedAudioAggregator;                             // 0x238(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UScopedAkComponent*>            AllAkComponents;                                   // 0x240(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FTransform                            ListenerTransform;                                 // 0x250(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          Azimuth_Elevation_Timer;                           // 0x2B0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_CreatureComponent_Audio_C* GetDefaultObj();

	void Spyglass_Update(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, int32 CallFunc_Add_IntInt_ReturnValue, const struct FTransform& CallFunc_GetListenerTransform_ReturnValue, class UScopedAkComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, double CallFunc_VSize_ReturnValue, float CallFunc_GetAzimuthAndElevation_Azimuth, float CallFunc_GetAzimuthAndElevation_Elevation, float CallFunc_SetRTPCValue_Value_ImplicitCast);
	void On_Creature_Audio_Loaded(class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event, bool K2Node_DynamicCast_bSuccess, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event_1, bool K2Node_DynamicCast_bSuccess_1, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_2, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_3, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event_2, bool K2Node_DynamicCast_bSuccess_2, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event_3, bool K2Node_DynamicCast_bSuccess_3, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_4, class UObject* CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_5, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event_4, bool K2Node_DynamicCast_bSuccess_4, class UAkAudioEvent* K2Node_DynamicCast_AsAk_Audio_Event_5, bool K2Node_DynamicCast_bSuccess_5, TArray<class UAkAudioEvent*>& K2Node_MakeArray_Array);
	void LoadAndCacheCreatureAudio(const TArray<TSoftObjectPtr<class UAkAudioEvent>>& ReactionSoftPtrs, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_Array_IsNotEmpty_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue_1, int32 CallFunc_Array_AddUnique_ReturnValue_2, int32 CallFunc_Array_AddUnique_ReturnValue_3, bool CallFunc_IsValidSoftObjectReference_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue_1, bool CallFunc_IsValidSoftObjectReference_ReturnValue_2, bool CallFunc_IsValidSoftObjectReference_ReturnValue_3, int32 CallFunc_Array_AddUnique_ReturnValue_4, bool CallFunc_IsValidSoftObjectReference_ReturnValue_4, int32 CallFunc_Array_AddUnique_ReturnValue_5, bool CallFunc_IsValidSoftObjectReference_ReturnValue_5);
	void GetAudioAggregator(class UAudioComponentAggregatorComponent** AudioAggregator, class AActor* CallFunc_GetOwner_ReturnValue, class UAudioComponentAggregatorComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void AddFootstepComponent(bool CallFunc_IsDedicatedServer_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class UBP_FootstepComponent_C* CallFunc_AddComponentByClass_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class UBP_FootstepComponent_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void GetDamageReactionSFX(double HitReactStrength, TSoftObjectPtr<class UAkAudioEvent>* DamageEventOut, enum class EHitReactType PredictedHitReactType, bool K2Node_SwitchEnum_CmpSuccess, uint8 CallFunc_MakeLiteralByte_ReturnValue, enum class EHitReactType CallFunc_GetHitReactTypeFromStrength_ReturnValue, uint8 CallFunc_MakeLiteralByte_ReturnValue_1, bool CallFunc_GreaterEqual_ByteByte_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_GetHitReactTypeFromStrength_Strength_ImplicitCast);
	void DissolveAudio(bool DissolveIn, class UAudioComponentAggregatorComponent* AudioAggregator, class UAkComponent* AkComponent, bool Temp_bool_Variable, class UAkAudioEvent* Temp_object_Variable, class UAkAudioEvent* Temp_object_Variable_1, TArray<struct FAkExternalSourceInfo>& Temp_struct_Variable, FDelegateProperty_ Temp_delegate_Variable, class UScopedAkComponent* CallFunc_GetAudioComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAudioComponentAggregatorComponent* CallFunc_GetAudioAggregator_AudioAggregator, class AActor* CallFunc_GetOwner_ReturnValue, class ABP_Creature_NPC_Human_C* K2Node_DynamicCast_AsBP_Creature_NPC_Human, bool K2Node_DynamicCast_bSuccess, class UAkAudioEvent* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue_1, int32 CallFunc_PostAkEvent_ReturnValue);
	void Load_All_Footstep_Assets(class UAudioPreloadSubsystem* CallFunc_GetWorldSubsystem_ReturnValue);
	void Cache_Footsteps(bool CallFunc_IsServer_ReturnValue);
	void CreatureDeath(class UScopedAkComponent* CreatureAkComponent, const TArray<class UScopedAkComponent*>& AllCreatureAkComponents, class UBP_Creature_Audio_Looping_C* LoopingAudioComponent, class UScopedAkComponent* HeadScopedAk, int32 Temp_int_Array_Index_Variable, bool CallFunc_IsValid_ReturnValue, bool CallFunc_Array_IsNotEmpty_ReturnValue, bool CallFunc_IsDedicatedServer_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_IsValidSoftObjectReference_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class UScopedAkComponent* CallFunc_GetAudioComponentForBucket_ReturnValue, bool CallFunc_PostAkEventScoped_ReturnValue, bool CallFunc_IsSuspended_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class UScopedAkComponent* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_PostAsyncAkEventScoped_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, class UBP_Creature_Audio_Looping_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class AActor* CallFunc_GetOwner_ReturnValue_2, TArray<class UScopedAkComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue);
	void CreatureEnterAlertState_Audio(class UAudioComponentAggregatorComponent* AudioAggregator, class UScopedAkComponent* AkComponent, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAudioComponentAggregatorComponent* CallFunc_GetAudioAggregator_AudioAggregator, class UScopedAkComponent* CallFunc_GetAudioComponent_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_PostAsyncAkEventScoped_ReturnValue, bool CallFunc_IsValidSoftObjectReference_ReturnValue);
	void CreatureTakeDamage_Audio(double DamageTaken, double HitReactStrength, class UScopedAkComponent* ReducedAk, class UScopedAkComponent* HeadAk, class UAudioComponentAggregatorComponent* AudioAggregator, class UScopedAkComponent* AggregateHeadAk, TSoftObjectPtr<class UAkAudioEvent> LReactionSFX, bool CallFunc_IsDedicatedServer_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValidSoftObjectReference_ReturnValue, class UAudioComponentAggregatorComponent* CallFunc_GetAudioAggregator_AudioAggregator, float CallFunc_CalculateModifiedStrength_ReturnValue, TSoftObjectPtr<class UAkAudioEvent> CallFunc_GetDamageReactionSFX_DamageEventOut, bool CallFunc_IsSuspended_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsSuspended_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_PostAkEventScoped_ReturnValue, bool CallFunc_PostAkEventScoped_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, class UScopedAkComponent* CallFunc_GetAudioComponent_ReturnValue, class UScopedAkComponent* CallFunc_GetAudioComponent_ReturnValue_1, class UScopedAkComponent* CallFunc_GetAudioComponent_ReturnValue_2, bool CallFunc_PostAsyncAkEventScoped_ReturnValue, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, float CallFunc_CalculateModifiedStrength_Strength_ImplicitCast, double CallFunc_GetDamageReactionSFX_HitReactStrength_ImplicitCast);
	void ReceiveBeginPlay();
	void AlertCooldown();
	void TakeDamageCooldown();
	void SpyglassState_Wildlife_Enter();
	void SpyglassState_Wildlife_Exit();
	void ReceiveTick(float DeltaSeconds);
	void AlertSpawnCooldown();
	void ExecuteUbergraph_BP_CreatureComponent_Audio(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, float K2Node_Event_DeltaSeconds, int32 CallFunc_Add_IntInt_ReturnValue_1, class AActor* CallFunc_GetOwner_ReturnValue_1, class ANWXAICharacter* K2Node_DynamicCast_AsNWXAICharacter, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetOwner_ReturnValue_2, class UScopedAkComponent* CallFunc_Array_Get_Item, TArray<class UScopedAkComponent*>& CallFunc_K2_GetComponentsByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_IsServer_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, int32 Temp_int_Array_Index_Variable_1, class UScopedAkComponent* CallFunc_Array_Get_Item_1, bool CallFunc_IsValid_ReturnValue_1, class UAmbienceManager* CallFunc_GetAmbienceManager_AmbienceManager, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_1, float CallFunc_SetAttenuationScalingFactor_Value_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_2);
};

}


