#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x88 (0x88 - 0x0)
// UserDefinedStruct S_WaterBodyAudioProperties.S_WaterBodyAudioProperties
struct FS_WaterBodyAudioProperties
{
public:
	class UAkAudioEvent*                         WaterAkEvent_2_B21671AD4100ACCEDDEDD1B7BA1F2792;   // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       EmitterSpeed_7_3DB02E814B706467426D3BBF40B4BD7C;   // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EmitterDistanceOffset_39_F753D6C044AB815FA4463F89688DE840; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EmitterHeightOffset_42_EBFE5B8646C62F92FB20BE90AF35C276; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       EmitterMergeDistance_48_0FE428F946947CF3DDFBCEB7515C2CDC; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseStickyMode_12_E3423FC24E9792D8008664A8DA02F0DD; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseOcclusion_38_333A563C400C887D69D015B118C986BF;  // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A485[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       OcclusionGridSpreadDistance_45_310D587B4BF3657EA12DCDB7E7B20D0F; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CheckMaterials_14_76BB8A094F280496FA39DC82153467A1; // 0x38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseElevationRTPC_36_9A836D854D7D332AFB61F882EC25C02E; // 0x39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseWindSpeed_50_D1CBA91D472C9378AE16E8B41E90EE4E;  // 0x3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_A486[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         WildlifeOSEvent_17_1704912541C59DFFA6E2748649E17190; // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMinRadius_20_C3F1E5994276F5D076C3FA82B028A1CB; // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMaxRadius_22_B9A33ABC49684AD06BA3B2A35D030982; // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMaxDelayTimeDesert_24_C8DC4623449ADB7D5A7F74807EED8BCB; // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMinDelayTimeDesert_26_A703E2734C086BC4DF9600B86B06A07C; // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMaxDelayTimeForest_28_C549A40E434C50A55AC597BF1524B0BC; // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMinDelayTimeForest_30_8F67AD2E4CF4F848C6717D884058B677; // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMaxDelayTimeSwamp_32_1F94928B4805605D1ED37CAED662D313; // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WildlifeOSMinDelayTimeSwamp_34_F8A9135442C575F0E166B2A42E6371BF; // 0x80(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


